# Roller Coaster

This is a project from the Codecademy Data Science Carrer Path.
The data supplied for this project is located in `Golden_Ticket_Award_Winners_Steel.csv`, `Golden_Ticket_Award_Winners_Wood.csv`, and `roller_coasters.csv`.

The Golden Ticket Awards are presented by *Amusement Today*, a trade pulication of the amusement industry.

First, I will start by exploring the Golden Ticket Award datasets.

In [37]:
import pandas as pd
import matplotlib.pyplot as plt

steel_awards = pd.read_csv('Golden_Ticket_Award_Winners_Steel.csv')
wooden_awards = pd.read_csv('Golden_Ticket_Award_Winners_Wood.csv')
steel_awards

,Rank,Name,Park,Location,Supplier,Year Built,Points,Year of Rank
0,1,Millennium Force,Cedar Point,"Sandusky, Ohio",Intamin,2000,1204,2013
1,2,Bizarro,Six Flags New England,"Agawam, Mass.",Intamin,2000,1011,2013
2,3,Expedition GeForce,Holiday Park,"Hassloch, Germany",Intamin,2001,598,2013
3,4,Nitro,Six Flags Great Adventure,"Jackson, N.J.",B&M,2001,596,2013
4,5,Apollo’s Chariot,Busch Gardens Williamsburg,"Williamsburg, Va.",B&M,1999,542,2013
...,...,...,...,...,...,...,...,...
175,46,Expedition Everest,Disney’s Animal Kingdom,"Orlando, Fla.",Vekoma,2006,82,2018
176,47,Storm Chaser,Kentucky Kingdom,"Louisville, Ky.",Rocky Mountain,2016,81,2018
177,48,Raging Bull,Six Flags Great America,"Gurnee, Ill.",B&M,1999,78,2018
178,49,Thunderbird,Holiday World,"Santa Claus, Ind.",B&M,2015,72,2018
179,50,Whizzer,Six Flags Great America,"Gurnee, Ill.",Schwarzkopf,1976,70,2018

In [38]:
wooden_awards

,Rank,Name,Park,Location,Supplier,Year Built,Points,Year of Rank
0,1,Boulder Dash,Lake Compounce,"Bristol, Conn.",CCI,2000,1333,2013
1,2,El Toro,Six Flags Great Adventure,"Jackson, N.J.",Intamin,2006,1302,2013
2,3,Phoenix,Knoebels Amusement Resort,"Elysburg, Pa.",Dinn/PTC-Schmeck,1985,1088,2013
3,4,The Voyage,Holiday World,"Santa Claus, Ind.",Gravity Group,2006,1086,2013
4,5,Thunderhead,Dollywood,"Pigeon Forge, Tenn.",GCII,2004,923,2013
...,...,...,...,...,...,...,...,...
175,46,Megafobia,Oakwood,"Pembrookshire, Wales",Custom Coasters,1996,84,2018
176,47,Hades 360,Mount Olympus,"Wisconsin Dells, Wis.",Gravity Group,2005,80,2018
177,48,Mine Blower,Fun Spot,"Kissimmee, Fla.",Gravity Group,2017,79,2018
178,49,Wooden Warrior,Quassy Amusement Park,"Meddlebury, Conn.",Gravity Group,2011,77,2018
179,50,Twister,Knoebels Amusement Resort,"Elysburg, Pa.",Fetterman/Knoebels,1999,75,2018

I can perform some exploratory data analysis on these datasets by:
    * Which parks have the most rides appearing in the awards lists?
    * Which suppliers have built the most awarded coasters?
    * Which coasters have been awared the most points over this time period?

The following two code blocks display the 10 parks with the greatest number of unique roller coasters appearing at any time on the awards lists.

In [33]:
parks_with_awarded_rides_steel = steel_awards[["Name", "Park", "Location"]].drop_duplicates().groupby(["Park", "Location"]).count().sort_values("Name", ascending = False).rename(columns = {"Name":"Count"})
parks_with_awarded_rides_steel.head(10)

                                              Count
Park                       Location
Cedar Point                Sandusky, Ohio         7
Busch Gardens Williamsburg Williamsburg, Va.      4
Six Flags New England      Agawam, Mass.          4
Six Flags Magic Mountain   Valencia, Calif.       3
Busch Gardens Tampa        Tampa, Fla.            3
Kings Dominion             Doswell, Va.           3
Six Flags Great America    Gurnee, Ill.           2
Kings Island               Mason, Ohio            2
Kentucky Kingdom           Louisville, Ky.        2
Six Flags Great Adventure  Jackson, N.J.          2

In [34]:
parks_with_awarded_rides_wooden = wooden_awards[["Name", "Park", "Location"]].drop_duplicates().groupby(["Park", "Location"]).count().sort_values("Name", ascending = False).rename(columns = {"Name":"Count"})
parks_with_awarded_rides_wooden.head(10)

                                                   Count
Park                      Location
Holiday World             Santa Claus, Ind.            6
Six Flags St. Louis       Eureka, Mo.                  4
Kennywood                 West Mifflin, Pa.            3
Knoebels Amusement Resort Elysburg, Pa.                3
Kings Island              Mason, Ohio                  3
Blackpool Pleasure Beach  Blackpool, England           2
Kings Dominion            Doswell, Va.                 2
Dollywood                 Pigeon Forge, Tenn.          2
Playland                  Vancouver, B.C., Canada      1
Quassy Amusement Park     Middlebury, Conn.            1

The following code blocks show which manufacturers produce the most awarded coasters.

In [40]:
producers_with_awarded_rides_steel = steel_awards[["Name", "Supplier"]].drop_duplicates().groupby(["Supplier"]).count().sort_values("Name", ascending = False).rename(columns = {"Name":"Count"})
producers_with_awarded_rides_steel.head(10)

                Count
Supplier
B&M                23
Intamin            13
Rocky Mountain      7
Schwarzkopf         7
RMC                 6
Mack                4
Arrow               2
Morgan              2
Chance              1
Lagoon              1

In [41]:
producers_with_awarded_rides_wooden = wooden_awards[["Name", "Supplier"]].drop_duplicates().groupby(["Supplier"]).count().sort_values("Name", ascending = False).rename(columns = {"Name":"Count"})
producers_with_awarded_rides_wooden.head(10)

                     Count
Supplier
Great Coasters Int.     13
Custom Coasters         12
Gravity Group            9
Rocky Mountain           4
Intamin                  4
GCII                     3
KECO                     2
CCI                      2
PTC/Miller               2
Vettel                   1